# Data Wrangling, I
Perform the following operations using Python on dataset(e.g., employee.csv)
1.Import all the required Python Libraries. And Load the Dataset into pandas data
frame.
2. Data Preprocessing: find the missing values in the data columnwise and display
statistical information.
3. Provide variable descriptions. Types of variables etc.Check the dimensions of the data frame
4. Data Formatting Summarize the types of variables by checking the data types (i.e., character, numeric, integer, factor, and logical) of the variables in the data set. If
variables are not in the correct data type, apply proper type conversions.
5. Data Normalization:Perform Z-Score transformation and plot box plot for any
column
6.Turn categorical variables into quantitative variables in Python.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r"C:\Users\91940\Documents\PR_Exam_DSBDA\PR_EXAM_DATASET\PR_EXAM_DATASET\Employee.csv")

In [3]:
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [4]:
#missing values in the data columnwise
df.isnull().sum()

Education                    0
JoiningYear                  0
City                         0
PaymentTier                  0
Age                          0
Gender                       0
EverBenched                  0
ExperienceInCurrentDomain    0
LeaveOrNot                   0
dtype: int64

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

In [6]:
#satistical info
df.describe()

,JoiningYear,PaymentTier,Age,ExperienceInCurrentDomain,LeaveOrNot
count,4653.000000,4653.000000,4653.000000,4653.000000,4653.000000
mean,2015.062970,2.698259,29.393295,2.905652,0.343864
std,1.863377,0.561435,4.826087,1.558240,0.475047
min,2012.000000,1.000000,22.000000,0.000000,0.000000
25%,2013.000000,3.000000,26.000000,2.000000,0.000000
50%,2015.000000,3.000000,28.000000,3.000000,0.000000
75%,2017.000000,3.000000,32.000000,4.000000,1.000000
max,2018.000000,3.000000,41.000000,7.000000,1.000000

In [7]:
#variable description
df.dtypes

Education                    object
JoiningYear                   int64
City                         object
PaymentTier                   int64
Age                           int64
Gender                       object
EverBenched                  object
ExperienceInCurrentDomain     int64
LeaveOrNot                    int64
dtype: object

In [8]:
#check the dimension of dataframe
print(df.shape,'\n',df.ndim)

(4653, 9)
 2

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

In [10]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [11]:
df['LeaveOrNot'].dtype

dtype('int64')

In [12]:
#Data Formatting Summarize the types of variables by checking the data types (i.e., character, numeric, integer, factor, and logical) 
#of the variables in the data set. If variables are not in the correct data type, apply proper type conversions.
df['PaymentTier']=df['PaymentTier'].astype('category')
df['LeaveOrNot']=df['LeaveOrNot'].astype('category')
df['LeaveOrNot'].dtype

CategoricalDtype(categories=[0, 1], ordered=False, categories_dtype=int64)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   category
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   category
dtypes: category(2), int64(3), object(4)
memory usage: 263.9+ KB

In [14]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [15]:
#Turn categorical variables into quantitative variables in Python
# quan=pd.get_dummies(df,columns=categorical_columns,drop_first=True)
# quan.head()

In [16]:
df['age_zscore']=(df['Age']-df['Age'].mean())/df['Age'].std()

In [17]:
df['age_zscore']

0       0.954543
1      -0.288701
2       1.783371
3      -0.495908
4      -1.117530
          ...
4648   -0.703115
4649    1.576164
4650   -0.495908
4651    0.125714
4652    0.747335
Name: age_zscore, Length: 4653, dtype: float64

In [18]:
df = pd.get_dummies(df, columns=['City'], drop_first=True)

print("\nUpdated DataFrame with Categorical Variables Encoded:")
print(df.head())

Updated DataFrame with Categorical Variables Encoded:
   Education  JoiningYear PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017           3   34    Male          No
1  Bachelors         2013           1   28  Female          No
2  Bachelors         2014           3   38  Female          No
3    Masters         2016           3   27    Male          No
4    Masters         2017           3   24    Male         Yes

   ExperienceInCurrentDomain LeaveOrNot  age_zscore  City_New Delhi  City_Pune
0                          0          0    0.954543           False      False
1                          3          1   -0.288701           False       True
2                          2          0    1.783371            True      False
3                          5          1   -0.495908           False      False
4                          2          1   -1.117530           False       True